In [71]:
import pandas as pd
ratings = pd.read_csv('C:/titanic.csv', delimiter=',')
print(ratings.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [16]:
import pandas as pd
ratings = pd.read_csv('C:/titanic.csv', delimiter=',')
print(ratings.isna())

     survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0       False   False  False  False  False  False  False     False  False
1       False   False  False  False  False  False  False     False  False
2       False   False  False  False  False  False  False     False  False
3       False   False  False  False  False  False  False     False  False
4       False   False  False  False  False  False  False     False  False
..        ...     ...    ...    ...    ...    ...    ...       ...    ...
886     False   False  False  False  False  False  False     False  False
887     False   False  False  False  False  False  False     False  False
888     False   False  False   True  False  False  False     False  False
889     False   False  False  False  False  False  False     False  False
890     False   False  False  False  False  False  False     False  False

       who  adult_male   deck  embark_town  alive  alone
0    False       False   True        False  False  False
1    False       False  False        False  False  False
2    False       False   True        False  False  False
3    False       False  False        False  False  False
4    False       False   True        False  False  False
..     ...         ...    ...          ...    ...    ...
886  False       False   True        False  False  False
887  False       False  False        False  False  False
888  False       False   True        False  False  False
889  False       False  False        False  False  False
890  False       False   True        False  False  False

[891 rows x 15 columns]

In [1]:
import pandas as pd
ratings = pd.read_csv('C:/titanic.csv', delimiter=',')
print(ratings.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB
None

In [2]:
import pandas as pd
ratings = pd.read_csv('C:/titanic.csv', delimiter=',')
a = ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [4]:
import pandas as pd
ratings = pd.read_csv('C:/titanic.csv', delimiter=',')
print(ratings.describe())

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
import pandas as pd
ratings = pd.read_csv('C:/titanic.csv', delimiter=',')
print(ratings)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [12]:
import pandas as pd
ratings = pd.read_csv('C:/titanic.csv', delimiter=',')
print(ratings['survived'])

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [20]:

print(sum(ratings['survived']))# количество выживших

342

In [27]:

male = sum(map(lambda x: x == 'male', ratings['sex']))# количество мужчин
print(male)

577

In [54]:

female = sum(map(lambda x: x != 'male', ratings['sex']))  # количество женщин
print(female)

314

In [34]:
people = len(ratings['survived']) # количество всего людей
print(people)

891

In [63]:
old_man = sum(map(lambda x: x == 'man', ratings['who']))
print(old_man / people * 100) # процент взрослых мужчин

60.26936026936027

In [36]:
print(ratings.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB
None

In [92]:
non = [891, 891, 891, 714, 891, 891, 891, 889, 891, 891, 891, 203, 889, 891, 891] # количество не пустых клеток для каждого столбца
print(sum(map(lambda x: people -x, non))) # общее количество пустых клеток

869

In [55]:
# а)
if male > female:
    print('мужчин больше чем женщин')
elif male < female:
    print('женщин больше чем мужчин')
else:
    print('мужчин столько же сколько женщин')

мужчин больше чем женщин

In [56]:
ratings.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

выводы которые можно сделать

минимальный возраст 0.42 года

максимальный возраст 80 лет

средний возраст 29.699118 лет

пассажиры Титаника были достаточно молодыми

177 человек неизвестен возраст

количество выжевшиз составило 342 человека

In [69]:
sum_class = [0, 0, 0]
for i in ratings['pclass']:
    sum_class[int(i) - 1] += 1
for i in range(3):
    print(f'class {i + 1}: {sum_class[i]}')

class 1: 216
class 2: 184
class 3: 491

In [74]:
survived_ratings = ratings[ratings['survived'] == 1]
print(survived_ratings) # таблица в которой только выжевшие пассажиры

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
8           1       3  female  27.0      0      2  11.1333        S   Third
9           1       2  female  14.0      1      0  30.0708        C  Second
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
875         1       3  female  15.0      0      0   7.2250        C   Third
879         1       1  female  56.0      0      1  83.1583        C   First
880         1       2  female  25.0      0      1  26.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
8    woman       False  NaN  Southampton   yes  False
9    child       False  NaN    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
875  child       False  NaN    Cherbourg   yes   True
879  woman       False    C    Cherbourg   yes  False
880  woman       False  NaN  Southampton   yes  False
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True

[342 rows x 15 columns]

Вывод выжело 342 человека

In [88]:
survived_people = len(survived_ratings['survived'])
survived_male = sum(map(lambda x: x == 'male', survived_ratings['sex']))# количество выживших мужчин
print('количество выживших мужчин:', survived_male)
survived_female = sum(map(lambda x: x != 'male', survived_ratings['sex']))  # количество выжившых женщин
print('количество выжившых женщин:', survived_female)
survived_old_man = sum(map(lambda x: x == 'man', survived_ratings['who']))
print('роцент взрослых выжившых мужчин', survived_old_man / survived_people * 100) # процент взрослых выжившых мужчин

количество выживших мужчин: 109
количество выжившых женщин: 233
роцент взрослых выжившых мужчин 25.730994152046783

Выводы взорслых мужчин выжило значительно меньше чем количество взорслых мужчин

In [79]:
survived_ratings.describe()

       survived      pclass         age       sibsp       parch        fare
count     342.0  342.000000  290.000000  342.000000  342.000000  342.000000
mean        1.0    1.950292   28.343690    0.473684    0.464912   48.395408
std         0.0    0.863321   14.950952    0.708688    0.771712   66.596998
min         1.0    1.000000    0.420000    0.000000    0.000000    0.000000
25%         1.0    1.000000   19.000000    0.000000    0.000000   12.475000
50%         1.0    2.000000   28.000000    0.000000    0.000000   26.000000
75%         1.0    3.000000   36.000000    1.000000    1.000000   57.000000
max         1.0    3.000000   80.000000    4.000000    5.000000  512.329200

In [80]:
ratings.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [81]:
survived_ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 342 entries, 1 to 889
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     342 non-null    int64
 1   pclass       342 non-null    int64
 2   sex          342 non-null    object
 3   age          290 non-null    float64
 4   sibsp        342 non-null    int64
 5   parch        342 non-null    int64
 6   fare         342 non-null    float64
 7   embarked     340 non-null    object
 8   class        342 non-null    object
 9   who          342 non-null    object
 10  adult_male   342 non-null    bool
 11  deck         136 non-null    object
 12  embark_town  340 non-null    object
 13  alive        342 non-null    object
 14  alone        342 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 38.1+ KB

In [91]:
survived_non = [342, 342, 342, 290, 342, 342, 342, 340, 342, 342, 342, 136, 340, 342, 342] # количество не пустых клеток для каждого столбца
print('общее количество пустых клеток среди выживших пассажиров:', sum(map(lambda x: survived_people -x, survived_non))) # общее количество пустых клеток

общее количество пустых клеток среди выживших пассажиров: 262

Пустые клетки есть в столбцах с названиями: age, embarked, deck, embark_town

Неизвестные значения в стоблце age я заменю на среднее значение что бы не сильно поменять среднее значение возраста и максимальный и минимальный возраст
в столбце embarked замени пустые клетки на значение котрое больше всего появляется в этом столбце S, 

в столбце deck заменим на значение котрое больше всего появляется в этом столбце nan 
embark_town пустые клетки заменем на S

In [100]:
counts = dict()
for i in ratings['deck']:
    counts[i] = counts.get(i, 0) + 1
    start = i
max_name = start
for i in counts:
    print(f'{i}: {counts[i]}')
    if counts[max_name] < counts[i]:
        max_name = i
print(f'Наиболее частое значение в столбце deck: {max_name}')

nan: 688
C: 59
E: 32
G: 4
D: 33
A: 15
B: 47
F: 13
Наиболее частое значение в столбце deck: nan

In [102]:
counts = dict()
for i in ratings['embark_town']:
    counts[i] = counts.get(i, 0) + 1
    start = i
max_name = start
for i in counts:
    print(f'{i}: {counts[i]}')
    if counts[max_name] < counts[i]:
        max_name = i
print(f'Наиболее частое значение в столбце embark_town: {max_name}')

Southampton: 644
Cherbourg: 168
Queenstown: 77
nan: 2
Наиболее частое значение в столбце embark_town: Southampton

In [103]:
counts = dict()
for i in ratings['embarked']:
    counts[i] = counts.get(i, 0) + 1
    start = i
max_name = start
for i in counts:
    print(f'{i}: {counts[i]}')
    if counts[max_name] < counts[i]:
        max_name = i
print(f'Наиболее частое значение в столбце embarked: {max_name}')

S: 644
C: 168
Q: 77
nan: 2
Наиболее частое значение в столбце embarked: S

In [105]:
ratings['age'].fillna(29.699118)
ratings['deck'].fillna('nan')
ratings['embark_town'].fillna('Southampton')
ratings['embarked'].fillna('S')
print(ratings)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]